{"﻿ PC Press dokumentacija\nhttps://pcpress.rs/prodavnica/\n\n    1. Da bismo poručili časopis moramo da štikliramo checkbox pored tog časopisa": null, "\n    2. Polje “Količina” je mandatory polje i prihvata brojeve od 1 do 100. \n    3. Kada štikliramo checkbox pored časopisa sa količinom dobijamo polje “kolicina” sa default vrednoscu 1": null, "\n    4. Kada štikliramo checkbox pored časopisa sa padajućim menijem prvi časopis odozgo je odabir po default-u": null, "\n    5. Kada kliknemo na dugme “KUPUJEM” otvara se pop-up window “Narudžbenica”": null, " u zaglavlju ovog prozora dobijamo sledeće informacije: Izabrali ste (ime časopisa), Količina, Cena, Iznos (din), Ukupan iznos\n    6. Koristimo samo opciju “Plaćam uplatnicom” - koja je odabrana po default-u": null, "\n    7. Polje “Ime i prezime” je mandatory polje, prihvata velika i mala slova i mora postojati razmak između dva unosa": null, "\n    8. Polje “Ulica i broj” je mandatory polje, prihvata sve karaktere i mora postojati razmak između dva unosa": null, "\n    9. Polja “Poštanski broj” i “Grad” treba da budu sinhronizovana:\n        a. Ako se unesu odgovarajuci input-i u ova polja - porudžbina treba da prođe": null, "\n        b. Ako se unesu neodgovarajuci input-i u ova polja - polja ce pocrveneti čim pređemo na sledeće polje": null, "\n    10. Polje “Telefon” je mandatory polje i prihvata 9 ili 10 brojeva/cifara": null, "\n    11. Polje “Email” je mandatory polje i prihvata validnu email formu": null, "\n    12. Polje “Napomena” je opciono polje i prihvata sve karaktere": null, "\n    13. Da bismo završili porudžbinu potrebno je da kliknemo na dugme “Naručujem”. Kada kliknemo na dugme “Naručujem” dešava se sledece:\n        a. Ako su uneti validni inputi - poružbina je uspešna i dobija se “Predračun” stranica": null, "\n        b. Ako su uneti nevalidni inputi - dobija se odgovarajuća greška.": null}